{
  "About This App": "حول هذا التطبيق",
  "This phone app serves as a platform for connecting with others, sharing insights, and addressing questions about topics you may encounter in Belgium. Below, you will find more details about the app’s main features.": "يعمل هذا التطبيق كمنصة للتواصل مع الآخرين، ومشاركة الأفكار، والإجابة على الأسئلة حول مواضيع قد تواجهها في بلجيكا. ستجد أدناه المزيد من التفاصيل حول الميزات الرئيسية للتطبيق.",
  "Community Section": "قسم المجتمع",
  "In the Community section, users can create a public profile through Google login. Once created, this profile is visible to others, allowing you to share photos and posts that the community can view. You can edit your profile anytime, delete posts, and even temporarily log out or delete your account entirely if needed. By tapping on others’ posts, you have the option to start a private conversation with them and explore detailed profile information. Please remember to be cautious with any personal information you share in this public space.": "في قسم المجتمع، يمكن للمستخدمين إنشاء ملف شخصي عام عبر تسجيل الدخول باستخدام Google. بمجرد إنشائه، يصبح هذا الملف مرئيًا للآخرين، مما يتيح لك مشاركة الصور والمنشورات التي يمكن للمجتمع رؤيتها. يمكنك تعديل ملفك الشخصي في أي وقت، حذف المنشورات، أو حتى تسجيل الخروج مؤقتًا أو حذف حسابك بالكامل إذا لزم الأمر. بالنقر على منشورات الآخرين، يمكنك بدء محادثة خاصة معهم واستكشاف معلومات ملفهم الشخصي بالتفصيل. يُرجى توخي الحذر عند مشاركة المعلومات الشخصية في هذا الفضاء العام.",
  "Q&A Section": "قسم الأسئلة والأجوبة",
  "This section offers a space for users to ask and answer questions on a variety of topics related to Belgium. However, please keep in mind that responses are based on users’ personal experiences or internet research and may not always reflect official information. Particularly in legal matters, we recommend consulting an official source or a licensed lawyer. The responses here are intended for general guidance and may become outdated over time.": "يوفر هذا القسم مساحة للمستخدمين لطرح الأسئلة والإجابة عنها في مواضيع متنوعة تتعلق ببلجيكا. لكن يُرجى مراعاة أن الردود تستند إلى تجارب شخصية للمستخدمين أو إلى بحوث عبر الإنترنت وقد لا تعكس دائمًا معلومات رسمية. في الأمور القانونية على وجه الخصوص، نوصي باستشارة مصدر رسمي أو محامٍ معتمد. الردود هنا معدة لأغراض توجيهية عامة وقد تصبح غير محدثة مع مرور الوقت.",
  "Suggestions & Complaints Section": "قسم الاقتراحات والشكاوى",
  "If you have suggestions or complaints or if there are specific questions you would like us to investigate, feel free to send us an email through this section. We value your feedback and strive to improve the app based on user input.": "إذا كانت لديك اقتراحات أو شكاوى أو إذا كانت هناك أسئلة محددة تود منا التحقيق فيها، فلا تتردد في إرسال بريد إلكتروني إلينا من خلال هذا القسم. نحن نقدر ملاحظاتك ونسعى لتحسين التطبيق بناءً على مساهمات المستخدمين.",
  "Close": "إغلاق",
  "Suggestion & Complaint": "اقتراح وشكوى",
  "About App": "حول التطبيق",
  "Community": "المجتمع",
  "Question & Answer": "سؤال وجواب",
  "Created by Yasir TIRAK": "تم الإنشاء بواسطة ياسر تيراك",
  "No data found.": "لم يتم العثور على بيانات.",
  "No menu items found.": "لم يتم العثور على عناصر قائمة.",
  "Explore Belgium": "استكشاف بلجيكا",
  "Search questions...": "البحث عن الأسئلة...",
  "No questions found.": "لم يتم العثور على أسئلة.",
  "Source": "المصدر",
  "Contacts": "جهات الاتصال",
  "No friends found.": "لم يتم العثور على أصدقاء.",
  "Unknown User": "مستخدم غير معروف",
  "Warning!": "تحذير!",
  "Okay": "حسنًا",
  "Failed to sign in with Google. Please try again.": "فشل تسجيل الدخول باستخدام Google. يرجى المحاولة مرة أخرى.",
  "Join Our Community": "انضم إلى مجتمعنا",
  "Continue with Google": "المتابعة مع Google",
  "An error occurred while sending the image.": "حدث خطأ أثناء إرسال الصورة.",
  "Delete Account": "حذف الحساب",
  "Are you sure you want to delete your account? This action cannot be undone.": "هل أنت متأكد أنك تريد حذف حسابك؟ هذا الإجراء لا يمكن التراجع عنه.",
  "Cancel": "إلغاء",
  "Delete": "حذف",
  "Error deleting account. Please try again.": "حدث خطأ أثناء حذف الحساب. يرجى المحاولة مرة أخرى.",
  "Update Profile": "تحديث الملف الشخصي",
  "Sign Out": "تسجيل الخروج",
  "Write a message...": "اكتب رسالة...",
  "Full Name must contain at least 3 characters and cannot contain numbers.": "يجب أن يحتوي الاسم الكامل على 3 أحرف على الأقل ولا يمكن أن يحتوي على أرقام.",
  "Age must be a number between 18 and 99.": "يجب أن يكون العمر رقمًا بين 18 و99.",
  "Short Info must be between 10 and 100 characters.": "يجب أن تكون المعلومات القصيرة بين 10 و100 حرف.",
  "Please select a profile image.": "يرجى اختيار صورة للملف الشخصي.",
  "OK": "موافق",
  "Full Name": "الاسم الكامل",
  "Age": "العمر",
  "Gender": "الجنس",
  "Country": "البلد",
  "Short Info": "معلومات قصيرة",
  "Delete Message": "حذف الرسالة",
  "Are you sure you want to delete this message?": "هل أنت متأكد أنك تريد حذف هذه الرسالة؟",
  "It will be added very soon. You can try opening this page in other languages.": "سيتم إضافته قريبًا جدًا. يمكنك محاولة فتح هذه الصفحة بلغات أخرى.",
  "Sending image...": "إرسال الصورة...",
  "Image could not be loaded": "تعذر تحميل الصورة",
  "Re-authentication failed. Account deletion canceled.": "فشل إعادة المصادقة. تم إلغاء حذف الحساب.",
  "An error occurred. Please try again.": "حدث خطأ. يرجى المحاولة مرة أخرى.",
  "An update will be coming soon for language support.": "سيتم إصدار تحديث قريبًا لدعم اللغات.",
  "Your own question": "سؤالك الخاص",
  "Question": "سؤال",
  "Explanation": "تفسير",
  "Invalid Question": "سؤال غير صالح",
  "Question must be between 10 and 100 characters.": "يجب أن يتراوح طول السؤال بين 10 و 100 حرفًا.",
  "Invalid Explanation": "تفسير غير صالح",
  "Explanation cannot exceed 300 characters.": "لا يمكن أن يتجاوز التفسير 300 حرف.",
  "Success": "نجاح",
  "Question added successfully! Your answer will be processed into the system within a few days.": "تمت إضافة السؤال بنجاح! سيتم معالجة إجابتك في النظام خلال بضعة أيام.",
  "Error": "خطأ",
  "Failed to add question. Please try again.": "فشل في إضافة السؤال. يرجى المحاولة مرة أخرى.",
  "Add": "إضافة",
  "WARNING": "تحذير",
  "After submitting your question, the answer will be added to the system within a few days.": "بعد تقديم سؤالك، ستتم إضافة الإجابة إلى النظام في غضون بضعة أيام.",
  "+ Add your own question": "+ أضف سؤالك الخاص",
  "Login with Email/Password": "تسجيل الدخول باستخدام البريد الإلكتروني/كلمة المرور",
  "Emails do not match.": "البريد الإلكتروني غير متطابق.",
  "Passwords do not match.": "كلمات المرور غير متطابقة.",
  "This email is already in use.": "هذا البريد الإلكتروني مستخدم بالفعل.",
  "Invalid email format.": "تنسيق البريد الإلكتروني غير صحيح.",
  "Password is too weak.": "كلمة المرور ضعيفة جدًا.",
  "Registration failed. Please try again.": "فشل التسجيل. يرجى المحاولة مرة أخرى.",
  "Register": "تسجيل",
  "Please enter an email.": "يرجى إدخال بريد إلكتروني.",
  "Please enter a valid email.": "يرجى إدخال بريد إلكتروني صالح.",
  "Confirm Email": "تأكيد البريد الإلكتروني",
  "Please confirm your email.": "يرجى تأكيد بريدك الإلكتروني.",
  "Password": "كلمة المرور",
  "Password must be at least 6 characters.": "يجب أن تكون كلمة المرور مكونة من 6 أحرف على الأقل.",
  "Confirm Password": "تأكيد كلمة المرور",
  "Please confirm your password.": "يرجى تأكيد كلمة المرور.",
  "No user found for this email.": "لم يتم العثور على مستخدم لهذا البريد الإلكتروني.",
  "Incorrect password. Please try again.": "كلمة المرور غير صحيحة. يرجى المحاولة مرة أخرى.",
  "The email address is not valid.": "عنوان البريد الإلكتروني غير صالح.",
  "This user account has been disabled.": "تم تعطيل حساب المستخدم هذا.",
  "Too many login attempts. Please try again later.": "عدد كبير جدًا من محاولات تسجيل الدخول. يرجى المحاولة لاحقًا.",
  "An unexpected error occurred. Please try again.": "حدث خطأ غير متوقع. يرجى المحاولة مرة أخرى.",
  "Please enter your email.": "يرجى إدخال بريدك الإلكتروني.",
  "Login": "تسجيل الدخول",
  "Don’t have an account? Register": "ليس لديك حساب؟ سجل الآن",
  "Reset Password": "إعادة تعيين كلمة المرور",
  "Enter your email to receive a password reset link.": "أدخل بريدك الإلكتروني لتلقي رابط إعادة تعيين كلمة المرور.",
  "Password reset link has been sent to your email.": "تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني.",
  "Send": "إرسال",
  "Forgot your password?": "هل نسيت كلمة المرور؟"

}
