{
  "About This App": "Über diese App",
  "This phone app serves as a platform for connecting with others, sharing insights, and addressing questions about topics you may encounter in Belgium. Below, you will find more details about the app’s main features.": "Diese Handy-App dient als Plattform, um sich mit anderen zu verbinden, Einblicke zu teilen und Fragen zu Themen zu beantworten, auf die Sie in Belgien stoßen könnten. Unten finden Sie weitere Details zu den Hauptfunktionen der App.",
  "Community Section": "Community-Bereich",
  "In the Community section, users can create a public profile through Google login. Once created, this profile is visible to others, allowing you to share photos and posts that the community can view. You can edit your profile anytime, delete posts, and even temporarily log out or delete your account entirely if needed. By tapping on others’ posts, you have the option to start a private conversation with them and explore detailed profile information. Please remember to be cautious with any personal information you share in this public space.": "Im Community-Bereich können Nutzer ein öffentliches Profil über die Google-Anmeldung erstellen. Sobald es erstellt ist, ist dieses Profil für andere sichtbar und ermöglicht es Ihnen, Fotos und Beiträge zu teilen, die die Community sehen kann. Sie können Ihr Profil jederzeit bearbeiten, Beiträge löschen und sich bei Bedarf sogar vorübergehend abmelden oder Ihr Konto vollständig löschen. Durch Tippen auf die Beiträge anderer können Sie eine private Unterhaltung mit ihnen beginnen und detaillierte Profilinformationen anzeigen. Bitte seien Sie vorsichtig mit persönlichen Informationen, die Sie in diesem öffentlichen Raum teilen.",
  "Q&A Section": "Fragen & Antworten-Bereich",
  "This section offers a space for users to ask and answer questions on a variety of topics related to Belgium. However, please keep in mind that responses are based on users’ personal experiences or internet research and may not always reflect official information. Particularly in legal matters, we recommend consulting an official source or a licensed lawyer. The responses here are intended for general guidance and may become outdated over time.": "Dieser Bereich bietet Nutzern die Möglichkeit, Fragen zu verschiedenen Themen rund um Belgien zu stellen und zu beantworten. Bitte beachten Sie jedoch, dass die Antworten auf persönlichen Erfahrungen der Nutzer oder Internetrecherchen basieren und nicht immer offizielle Informationen widerspiegeln. Besonders in rechtlichen Angelegenheiten empfehlen wir, eine offizielle Quelle oder einen zugelassenen Anwalt zu konsultieren. Die Antworten hier dienen der allgemeinen Orientierung und könnten mit der Zeit veraltet sein.",
  "Suggestions & Complaints Section": "Vorschläge & Beschwerden-Bereich",
  "If you have suggestions or complaints or if there are specific questions you would like us to investigate, feel free to send us an email through this section. We value your feedback and strive to improve the app based on user input.": "Wenn Sie Vorschläge oder Beschwerden haben oder bestimmte Fragen, die wir untersuchen sollen, können Sie uns über diesen Bereich eine E-Mail senden. Wir schätzen Ihr Feedback und bemühen uns, die App basierend auf den Rückmeldungen der Nutzer zu verbessern.",
  "Close": "Schließen",
  "Suggestion & Complaint": "Vorschlag & Beschwerde",
  "About App": "Über die App",
  "Community": "Community",
  "Question & Answer": "Frage & Antwort",
  "Created by Yasir TIRAK": "Erstellt von Yasir TIRAK",
  "No data found.": "Keine Daten gefunden.",
  "No menu items found.": "Keine Menüeinträge gefunden.",
  "Explore Belgium": "Belgien erkunden",
  "Search questions...": "Fragen durchsuchen...",
  "No questions found.": "Keine Fragen gefunden.",
  "Source": "Quelle",
  "Contacts": "Kontakte",
  "No friends found.": "Keine Freunde gefunden.",
  "Unknown User": "Unbekannter Benutzer",
  "Warning!": "Warnung!",
  "Okay": "Okay",
  "Failed to sign in with Google. Please try again.": "Anmeldung mit Google fehlgeschlagen. Bitte versuchen Sie es erneut.",
  "Join Our Community": "Treten Sie unserer Community bei",
  "Continue with Google": "Mit Google fortfahren",
  "An error occurred while sending the image.": "Beim Senden des Bildes ist ein Fehler aufgetreten.",
  "Delete Account": "Konto löschen",
  "Are you sure you want to delete your account? This action cannot be undone.": "Sind Sie sicher, dass Sie Ihr Konto löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.",
  "Cancel": "Abbrechen",
  "Delete": "Löschen",
  "Error deleting account. Please try again.": "Fehler beim Löschen des Kontos. Bitte versuchen Sie es erneut.",
  "Update Profile": "Profil aktualisieren",
  "Sign Out": "Abmelden",
  "Write a message...": "Nachricht schreiben...",
  "Full Name must contain at least 3 characters and cannot contain numbers.": "Der vollständige Name muss mindestens 3 Zeichen enthalten und darf keine Zahlen enthalten.",
  "Age must be a number between 18 and 99.": "Das Alter muss eine Zahl zwischen 18 und 99 sein.",
  "Short Info must be between 10 and 100 characters.": "Die Kurzinfo muss zwischen 10 und 100 Zeichen enthalten.",
  "Please select a profile image.": "Bitte wählen Sie ein Profilbild.",
  "OK": "OK",
  "Full Name": "Vollständiger Name",
  "Age": "Alter",
  "Gender": "Geschlecht",
  "Country": "Land",
  "Short Info": "Kurzinfo",
  "Delete Message": "Nachricht löschen",
  "Are you sure you want to delete this message?": "Sind Sie sicher, dass Sie diese Nachricht löschen möchten?",
  "It will be added very soon. You can try opening this page in other languages.": "Es wird sehr bald hinzugefügt. Sie können versuchen, diese Seite in anderen Sprachen zu öffnen.",
  "Sending image...": "Bild wird gesendet...",
  "Image could not be loaded": "Bild konnte nicht geladen werden",
  "Re-authentication failed. Account deletion canceled.": "Re-Authentifizierung fehlgeschlagen. Kontolöschung abgebrochen.",
  "An error occurred. Please try again.": "Ein Fehler ist aufgetreten. Bitte versuchen Sie es erneut.",
  "An update will be coming soon for language support.": "Ein Update wird bald zur Unterstützung von Sprachen kommen.",
  "Your own question": "Ihre eigene Frage",
  "Question": "Frage",
  "Explanation": "Erklärung",
  "Invalid Question": "Ungültige Frage",
  "Question must be between 10 and 100 characters.": "Die Frage muss zwischen 10 und 100 Zeichen lang sein.",
  "Invalid Explanation": "Ungültige Erklärung",
  "Explanation cannot exceed 300 characters.": "Die Erklärung darf nicht mehr als 300 Zeichen enthalten.",
  "Success": "Erfolg",
  "Question added successfully! Your answer will be processed into the system within a few days.": "Frage erfolgreich hinzugefügt! Ihre Antwort wird innerhalb weniger Tage in das System aufgenommen.",
  "Error": "Fehler",
  "Failed to add question. Please try again.": "Frage konnte nicht hinzugefügt werden. Bitte versuchen Sie es erneut.",
  "Add": "Hinzufügen",
  "WARNING": "WARNUNG",
  "After submitting your question, the answer will be added to the system within a few days.": "Nach dem Einreichen Ihrer Frage wird die Antwort innerhalb weniger Tage dem System hinzugefügt.",
  "+ Add your own question": "+ Eigene Frage hinzufügen",
  "Login with Email/Password": "Mit E-Mail/Passwort anmelden",
  "Emails do not match.": "E-Mails stimmen nicht überein.",
  "Passwords do not match.": "Passwörter stimmen nicht überein.",
  "This email is already in use.": "Diese E-Mail wird bereits verwendet.",
  "Invalid email format.": "Ungültiges E-Mail-Format.",
  "Password is too weak.": "Das Passwort ist zu schwach.",
  "Registration failed. Please try again.": "Registrierung fehlgeschlagen. Bitte versuchen Sie es erneut.",
  "Register": "Registrieren",
  "Please enter an email.": "Bitte geben Sie eine E-Mail-Adresse ein.",
  "Please enter a valid email.": "Bitte geben Sie eine gültige E-Mail-Adresse ein.",
  "Confirm Email": "E-Mail bestätigen",
  "Please confirm your email.": "Bitte bestätigen Sie Ihre E-Mail-Adresse.",
  "Password": "Passwort",
  "Password must be at least 6 characters.": "Das Passwort muss mindestens 6 Zeichen lang sein.",
  "Confirm Password": "Passwort bestätigen",
  "Please confirm your password.": "Bitte bestätigen Sie Ihr Passwort.",
  "No user found for this email.": "Kein Benutzer für diese E-Mail gefunden.",
  "Incorrect password. Please try again.": "Falsches Passwort. Bitte versuchen Sie es erneut.",
  "The email address is not valid.": "Die E-Mail-Adresse ist ungültig.",
  "This user account has been disabled.": "Dieses Benutzerkonto wurde deaktiviert.",
  "Too many login attempts. Please try again later.": "Zu viele Anmeldeversuche. Bitte versuchen Sie es später erneut.",
  "An unexpected error occurred. Please try again.": "Ein unerwarteter Fehler ist aufgetreten. Bitte versuchen Sie es erneut.",
  "Please enter your email.": "Bitte geben Sie Ihre E-Mail-Adresse ein.",
  "Login": "Anmelden",
  "Don’t have an account? Register": "Sie haben kein Konto? Registrieren",
  "Reset Password": "Passwort zurücksetzen",
  "Enter your email to receive a password reset link.": "Geben Sie Ihre E-Mail-Adresse ein, um einen Link zum Zurücksetzen des Passworts zu erhalten.",
  "Password reset link has been sent to your email.": "Der Link zum Zurücksetzen des Passworts wurde an Ihre E-Mail gesendet.",
  "Send": "Senden",
  "Forgot your password?": "Haben Sie Ihr Passwort vergessen?"









}
