{
  "About This App": "Acerca de esta aplicación",
  "This phone app serves as a platform for connecting with others, sharing insights, and addressing questions about topics you may encounter in Belgium. Below, you will find more details about the app’s main features.": "Esta aplicación sirve como una plataforma para conectarse con otros, compartir ideas y responder preguntas sobre temas que puede encontrar en Bélgica. A continuación, encontrará más detalles sobre las principales características de la aplicación.",
  "Community Section": "Sección de Comunidad",
  "In the Community section, users can create a public profile through Google login. Once created, this profile is visible to others, allowing you to share photos and posts that the community can view. You can edit your profile anytime, delete posts, and even temporarily log out or delete your account entirely if needed. By tapping on others’ posts, you have the option to start a private conversation with them and explore detailed profile information. Please remember to be cautious with any personal information you share in this public space.": "En la sección de Comunidad, los usuarios pueden crear un perfil público a través del inicio de sesión de Google. Una vez creado, este perfil es visible para los demás, permitiéndole compartir fotos y publicaciones que la comunidad pueda ver. Puede editar su perfil en cualquier momento, eliminar publicaciones e incluso cerrar sesión temporalmente o eliminar su cuenta por completo si es necesario. Al tocar en las publicaciones de otros, tiene la opción de iniciar una conversación privada con ellos y explorar información detallada del perfil. Recuerde ser cauteloso con cualquier información personal que comparta en este espacio público.",
  "Q&A Section": "Sección de Preguntas y Respuestas",
  "This section offers a space for users to ask and answer questions on a variety of topics related to Belgium. However, please keep in mind that responses are based on users’ personal experiences or internet research and may not always reflect official information. Particularly in legal matters, we recommend consulting an official source or a licensed lawyer. The responses here are intended for general guidance and may become outdated over time.": "Esta sección ofrece un espacio para que los usuarios hagan y respondan preguntas sobre una variedad de temas relacionados con Bélgica. Sin embargo, tenga en cuenta que las respuestas se basan en experiencias personales de los usuarios o en investigaciones en internet y no siempre reflejan información oficial. Particularmente en temas legales, recomendamos consultar una fuente oficial o un abogado autorizado. Las respuestas aquí están destinadas a una orientación general y pueden quedar desactualizadas con el tiempo.",
  "Suggestions & Complaints Section": "Sección de Sugerencias y Quejas",
  "If you have suggestions or complaints or if there are specific questions you would like us to investigate, feel free to send us an email through this section. We value your feedback and strive to improve the app based on user input.": "Si tiene sugerencias o quejas o si hay preguntas específicas que le gustaría que investiguemos, no dude en enviarnos un correo electrónico a través de esta sección. Valoramos sus comentarios y nos esforzamos por mejorar la aplicación basándonos en las opiniones de los usuarios.",
  "Close": "Cerrar",
  "Suggestion & Complaint": "Sugerencia y Queja",
  "About App": "Acerca de la aplicación",
  "Community": "Comunidad",
  "Question & Answer": "Pregunta y Respuesta",
  "Created by Yasir TIRAK": "Creado por Yasir TIRAK",
  "No data found.": "No se encontraron datos.",
  "No menu items found.": "No se encontraron elementos de menú.",
  "Explore Belgium": "Explorar Bélgica",
  "Search questions...": "Buscar preguntas...",
  "No questions found.": "No se encontraron preguntas.",
  "Source": "Fuente",
  "Contacts": "Contactos",
  "No friends found.": "No se encontraron amigos.",
  "Unknown User": "Usuario desconocido",
  "Warning!": "¡Advertencia!",
  "Okay": "Aceptar",
  "Failed to sign in with Google. Please try again.": "Error al iniciar sesión con Google. Por favor, intente de nuevo.",
  "Join Our Community": "Únase a nuestra comunidad",
  "Continue with Google": "Continuar con Google",
  "An error occurred while sending the image.": "Ocurrió un error al enviar la imagen.",
  "Delete Account": "Eliminar cuenta",
  "Are you sure you want to delete your account? This action cannot be undone.": "¿Está seguro de que desea eliminar su cuenta? Esta acción no se puede deshacer.",
  "Cancel": "Cancelar",
  "Delete": "Eliminar",
  "Error deleting account. Please try again.": "Error al eliminar la cuenta. Por favor, intente de nuevo.",
  "Update Profile": "Actualizar perfil",
  "Sign Out": "Cerrar sesión",
  "Write a message...": "Escriba un mensaje...",
  "Full Name must contain at least 3 characters and cannot contain numbers.": "El nombre completo debe contener al menos 3 caracteres y no puede contener números.",
  "Age must be a number between 18 and 99.": "La edad debe ser un número entre 18 y 99.",
  "Short Info must be between 10 and 100 characters.": "La información breve debe tener entre 10 y 100 caracteres.",
  "Please select a profile image.": "Por favor, seleccione una imagen de perfil.",
  "OK": "OK",
  "Full Name": "Nombre completo",
  "Age": "Edad",
  "Gender": "Género",
  "Country": "País",
  "Short Info": "Información breve",
  "Delete Message": "Eliminar mensaje",
  "Are you sure you want to delete this message?": "¿Está seguro de que desea eliminar este mensaje?",
  "It will be added very soon. You can try opening this page in other languages.": "Se añadirá muy pronto. Puedes intentar abrir esta página en otros idiomas.",
  "Sending image...": "Enviando imagen...",
  "Image could not be loaded": "No se pudo cargar la imagen",
  "Re-authentication failed. Account deletion canceled.": "Falló la reautenticación. Eliminación de cuenta cancelada.",
  "An error occurred. Please try again.": "Ocurrió un error. Por favor, inténtelo de nuevo.",
  "An update will be coming soon for language support.": "Pronto llegará una actualización para el soporte de idiomas.",
  "Your own question": "Tu propia pregunta",
  "Question": "Pregunta",
  "Explanation": "Explicación",
  "Invalid Question": "Pregunta no válida",
  "Question must be between 10 and 100 characters.": "La pregunta debe tener entre 10 y 100 caracteres.",
  "Invalid Explanation": "Explicación no válida",
  "Explanation cannot exceed 300 characters.": "La explicación no puede superar los 300 caracteres.",
  "Success": "Éxito",
  "Question added successfully! Your answer will be processed into the system within a few days.": "¡Pregunta añadida con éxito! Su respuesta será procesada en el sistema en unos pocos días.",
  "Error": "Error",
  "Failed to add question. Please try again.": "No se pudo añadir la pregunta. Por favor, inténtelo de nuevo.",
  "Add": "Añadir",
  "WARNING": "ADVERTENCIA",
  "After submitting your question, the answer will be added to the system within a few days.": "Después de enviar su pregunta, la respuesta será añadida al sistema en unos pocos días.",
  "+ Add your own question": "+ Añade tu propia pregunta",
  "Login with Email/Password": "Iniciar sesión con correo electrónico/contraseña",
  "Emails do not match.": "Los correos electrónicos no coinciden.",
  "Passwords do not match.": "Las contraseñas no coinciden.",
  "This email is already in use.": "Este correo electrónico ya está en uso.",
  "Invalid email format.": "Formato de correo electrónico no válido.",
  "Password is too weak.": "La contraseña es demasiado débil.",
  "Registration failed. Please try again.": "El registro falló. Por favor, inténtelo de nuevo.",
  "Register": "Registrarse",
  "Please enter an email.": "Por favor, introduzca un correo electrónico.",
  "Please enter a valid email.": "Por favor, introduzca un correo electrónico válido.",
  "Confirm Email": "Confirmar correo electrónico",
  "Please confirm your email.": "Por favor, confirme su correo electrónico.",
  "Password": "Contraseña",
  "Password must be at least 6 characters.": "La contraseña debe tener al menos 6 caracteres.",
  "Confirm Password": "Confirmar contraseña",
  "Please confirm your password.": "Por favor, confirme su contraseña.",
  "No user found for this email.": "No se encontró ningún usuario con este correo electrónico.",
  "Incorrect password. Please try again.": "Contraseña incorrecta. Por favor, inténtelo de nuevo.",
  "The email address is not valid.": "La dirección de correo electrónico no es válida.",
  "This user account has been disabled.": "Esta cuenta de usuario ha sido desactivada.",
  "Too many login attempts. Please try again later.": "Demasiados intentos de inicio de sesión. Por favor, inténtelo más tarde.",
  "An unexpected error occurred. Please try again.": "Ocurrió un error inesperado. Por favor, inténtelo de nuevo.",
  "Please enter your email.": "Por favor, introduzca su correo electrónico.",
  "Login": "Iniciar sesión",
  "Don’t have an account? Register": "¿No tienes una cuenta? Regístrate",
  "Reset Password": "Restablecer Contraseña",
  "Enter your email to receive a password reset link.": "Ingrese su correo electrónico para recibir un enlace para restablecer la contraseña.",
  "Password reset link has been sent to your email.": "El enlace para restablecer la contraseña ha sido enviado a su correo electrónico.",
  "Send": "Enviar",
  "Forgot your password?": "¿Olvidó su contraseña?",










}
