
{
  "About This App": "À propos de cette application",
  "This phone app serves as a platform for connecting with others, sharing insights, and addressing questions about topics you may encounter in Belgium. Below, you will find more details about the app’s main features.": "Cette application mobile sert de plateforme pour se connecter avec d'autres personnes, partager des idées et répondre aux questions sur des sujets que vous pourriez rencontrer en Belgique. Vous trouverez ci-dessous plus de détails sur les fonctionnalités principales de l'application.",
  "Community Section": "Section Communauté",
  "In the Community section, users can create a public profile through Google login. Once created, this profile is visible to others, allowing you to share photos and posts that the community can view. You can edit your profile anytime, delete posts, and even temporarily log out or delete your account entirely if needed. By tapping on others’ posts, you have the option to start a private conversation with them and explore detailed profile information. Please remember to be cautious with any personal information you share in this public space.": "Dans la section Communauté, les utilisateurs peuvent créer un profil public via la connexion Google. Une fois créé, ce profil est visible par les autres, vous permettant de partager des photos et des publications visibles par la communauté. Vous pouvez modifier votre profil à tout moment, supprimer des publications, vous déconnecter temporairement ou supprimer complètement votre compte si nécessaire. En appuyant sur les publications des autres, vous avez la possibilité de commencer une conversation privée avec eux et d'explorer des informations détaillées de leur profil. Veuillez faire attention aux informations personnelles que vous partagez dans cet espace public.",
  "Q&A Section": "Section Questions & Réponses",
  "This section offers a space for users to ask and answer questions on a variety of topics related to Belgium. However, please keep in mind that responses are based on users’ personal experiences or internet research and may not always reflect official information. Particularly in legal matters, we recommend consulting an official source or a licensed lawyer. The responses here are intended for general guidance and may become outdated over time.": "Cette section offre un espace où les utilisateurs peuvent poser des questions et y répondre sur divers sujets relatifs à la Belgique. Cependant, veuillez noter que les réponses sont basées sur les expériences personnelles des utilisateurs ou des recherches sur Internet et ne reflètent pas toujours des informations officielles. En particulier pour des questions juridiques, nous recommandons de consulter une source officielle ou un avocat agréé. Les réponses ici sont destinées à une orientation générale et peuvent devenir obsolètes avec le temps.",
  "Suggestions & Complaints Section": "Section Suggestions & Réclamations",
  "If you have suggestions or complaints or if there are specific questions you would like us to investigate, feel free to send us an email through this section. We value your feedback and strive to improve the app based on user input.": "Si vous avez des suggestions ou des réclamations ou si vous avez des questions spécifiques que vous souhaitez que nous examinions, n'hésitez pas à nous envoyer un e-mail via cette section. Nous valorisons vos retours et nous nous efforçons d'améliorer l'application en fonction des contributions des utilisateurs.",
  "Close": "Fermer",
  "Suggestion & Complaint": "Suggestion & Réclamation",
  "About App": "À propos de l'application",
  "Community": "Communauté",
  "Question & Answer": "Questions & Réponses",
  "Created by Yasir TIRAK": "Créé par Yasir TIRAK",
  "No data found.": "Aucune donnée trouvée.",
  "No menu items found.": "Aucun élément de menu trouvé.",
  "Explore Belgium": "Explorer la Belgique",
  "Search questions...": "Rechercher des questions...",
  "No questions found.": "Aucune question trouvée.",
  "Source": "Source",
  "Contacts": "Contacts",
  "No friends found.": "Aucun ami trouvé.",
  "Unknown User": "Utilisateur inconnu",
  "Warning!": "Attention !",
  "Okay": "D'accord",
  "Failed to sign in with Google. Please try again.": "Échec de la connexion avec Google. Veuillez réessayer.",
  "Join Our Community": "Rejoignez notre communauté",
  "Continue with Google": "Continuer avec Google",
  "An error occurred while sending the image.": "Une erreur s'est produite lors de l'envoi de l'image.",
  "Delete Account": "Supprimer le compte",
  "Are you sure you want to delete your account? This action cannot be undone.": "Êtes-vous sûr de vouloir supprimer votre compte ? Cette action est irréversible.",
  "Cancel": "Annuler",
  "Delete": "Supprimer",
  "Error deleting account. Please try again.": "Erreur lors de la suppression du compte. Veuillez réessayer.",
  "Update Profile": "Mettre à jour le profil",
  "Sign Out": "Se déconnecter",
  "Write a message...": "Écrire un message...",
  "Full Name must contain at least 3 characters and cannot contain numbers.": "Le nom complet doit contenir au moins 3 caractères et ne peut pas contenir de chiffres.",
  "Age must be a number between 18 and 99.": "L'âge doit être un nombre compris entre 18 et 99.",
  "Short Info must be between 10 and 100 characters.": "Les informations courtes doivent comporter entre 10 et 100 caractères.",
  "Please select a profile image.": "Veuillez sélectionner une image de profil.",
  "OK": "OK",
  "Full Name": "Nom complet",
  "Age": "Âge",
  "Gender": "Sexe",
  "Country": "Pays",
  "Short Info": "Infos courtes",
  "Delete Message": "Supprimer le message",
  "Are you sure you want to delete this message?": "Êtes-vous sûr de vouloir supprimer ce message ?",
  "It will be added very soon. You can try opening this page in other languages.": "Il sera ajouté très bientôt. Vous pouvez essayer d'ouvrir cette page dans d'autres langues.",
  "Sending image...": "Envoi de l'image...",
  "Image could not be loaded": "L'image n'a pas pu être chargée",
  "Re-authentication failed. Account deletion canceled.": "Ré-authentification échouée. Suppression du compte annulée.",
  "An error occurred. Please try again.": "Une erreur s'est produite. Veuillez réessayer.",
  "An update will be coming soon for language support.": "Une mise à jour arrivera bientôt pour la prise en charge des langues.",
  "Your own question": "Votre propre question",
  "Question": "Question",
  "Explanation": "Explication",
  "Invalid Question": "Question invalide",
  "Question must be between 10 and 100 characters.": "La question doit comporter entre 10 et 100 caractères.",
  "Invalid Explanation": "Explication invalide",
  "Explanation cannot exceed 300 characters.": "L'explication ne peut pas dépasser 300 caractères.",
  "Success": "Succès",
  "Question added successfully! Your answer will be processed into the system within a few days.": "Question ajoutée avec succès ! Votre réponse sera traitée dans le système dans quelques jours.",
  "Error": "Erreur",
  "Failed to add question. Please try again.": "Échec de l'ajout de la question. Veuillez réessayer.",
  "Add": "Ajouter",
  "WARNING": "AVERTISSEMENT",
  "After submitting your question, the answer will be added to the system within a few days.": "Après avoir soumis votre question, la réponse sera ajoutée au système dans quelques jours.",
  "+ Add your own question": "+ Ajoutez votre propre question",
  "Login with Email/Password": "Se connecter avec e-mail/mot de passe",
  "Emails do not match.": "Les e-mails ne correspondent pas.",
  "Passwords do not match.": "Les mots de passe ne correspondent pas.",
  "This email is already in use.": "Cet e-mail est déjà utilisé.",
  "Invalid email format.": "Format d'e-mail invalide.",
  "Password is too weak.": "Le mot de passe est trop faible.",
  "Registration failed. Please try again.": "L'inscription a échoué. Veuillez réessayer.",
  "Register": "S'inscrire",
  "Please enter an email.": "Veuillez entrer un e-mail.",
  "Please enter a valid email.": "Veuillez entrer un e-mail valide.",
  "Confirm Email": "Confirmer l'e-mail",
  "Please confirm your email.": "Veuillez confirmer votre e-mail.",
  "Password": "Mot de passe",
  "Password must be at least 6 characters.": "Le mot de passe doit contenir au moins 6 caractères.",
  "Confirm Password": "Confirmer le mot de passe",
  "Please confirm your password.": "Veuillez confirmer votre mot de passe.",
  "No user found for this email.": "Aucun utilisateur trouvé pour cet e-mail.",
  "Incorrect password. Please try again.": "Mot de passe incorrect. Veuillez réessayer.",
  "The email address is not valid.": "L'adresse e-mail n'est pas valide.",
  "This user account has been disabled.": "Ce compte utilisateur a été désactivé.",
  "Too many login attempts. Please try again later.": "Trop de tentatives de connexion. Veuillez réessayer plus tard.",
  "An unexpected error occurred. Please try again.": "Une erreur inattendue est survenue. Veuillez réessayer.",
  "Please enter your email.": "Veuillez entrer votre e-mail.",
  "Login": "Connexion",
  "Don’t have an account? Register": "Vous n'avez pas de compte ? Inscrivez-vous",
  "Reset Password": "Réinitialiser le mot de passe",
  "Enter your email to receive a password reset link.": "Entrez votre e-mail pour recevoir un lien de réinitialisation du mot de passe.",
  "Password reset link has been sent to your email.": "Le lien de réinitialisation du mot de passe a été envoyé à votre e-mail.",
  "Send": "Envoyer",
  "Forgot your password?": "Mot de passe oublié ?"


}
