{
  "About This App": "Informazioni su questa app",
  "This phone app serves as a platform for connecting with others, sharing insights, and addressing questions about topics you may encounter in Belgium. Below, you will find more details about the app’s main features.": "Questa app per telefono è una piattaforma per connettersi con altri, condividere informazioni e rispondere a domande su argomenti che si possono incontrare in Belgio. Di seguito troverai maggiori dettagli sulle principali funzionalità dell'app.",
  "Community Section": "Sezione Comunità",
  "In the Community section, users can create a public profile through Google login. Once created, this profile is visible to others, allowing you to share photos and posts that the community can view. You can edit your profile anytime, delete posts, and even temporarily log out or delete your account entirely if needed. By tapping on others’ posts, you have the option to start a private conversation with them and explore detailed profile information. Please remember to be cautious with any personal information you share in this public space.": "Nella sezione Comunità, gli utenti possono creare un profilo pubblico tramite l'accesso con Google. Una volta creato, questo profilo è visibile agli altri, permettendo di condividere foto e post che la comunità può vedere. Puoi modificare il tuo profilo in qualsiasi momento, eliminare post, e persino uscire temporaneamente o eliminare completamente il tuo account se necessario. Toccando i post di altri, puoi avviare una conversazione privata con loro e visualizzare informazioni dettagliate del profilo. Si prega di fare attenzione con le informazioni personali condivise in questo spazio pubblico.",
  "Q&A Section": "Sezione Domande e Risposte",
  "This section offers a space for users to ask and answer questions on a variety of topics related to Belgium. However, please keep in mind that responses are based on users’ personal experiences or internet research and may not always reflect official information. Particularly in legal matters, we recommend consulting an official source or a licensed lawyer. The responses here are intended for general guidance and may become outdated over time.": "Questa sezione offre uno spazio per fare e rispondere a domande su una varietà di argomenti relativi al Belgio. Tuttavia, tieni presente che le risposte si basano sulle esperienze personali degli utenti o su ricerche online e potrebbero non riflettere sempre informazioni ufficiali. In particolare per questioni legali, consigliamo di consultare una fonte ufficiale o un avvocato autorizzato. Le risposte qui sono pensate per una guida generale e potrebbero diventare obsolete nel tempo.",
  "Suggestions & Complaints Section": "Sezione Suggerimenti e Reclami",
  "If you have suggestions or complaints or if there are specific questions you would like us to investigate, feel free to send us an email through this section. We value your feedback and strive to improve the app based on user input.": "Se hai suggerimenti o reclami o se ci sono domande specifiche che desideri che indaghiamo, inviaci un'email attraverso questa sezione. Apprezziamo i tuoi feedback e ci impegniamo a migliorare l'app basandoci sulle opinioni degli utenti.",
  "Close": "Chiudi",
  "Suggestion & Complaint": "Suggerimento e Reclamo",
  "About App": "Informazioni sull'App",
  "Community": "Comunità",
  "Question & Answer": "Domanda e Risposta",
  "Created by Yasir TIRAK": "Creato da Yasir TIRAK",
  "No data found.": "Nessun dato trovato.",
  "No menu items found.": "Nessun elemento di menu trovato.",
  "Explore Belgium": "Esplora il Belgio",
  "Search questions...": "Cerca domande...",
  "No questions found.": "Nessuna domanda trovata.",
  "Source": "Fonte",
  "Contacts": "Contatti",
  "No friends found.": "Nessun amico trovato.",
  "Unknown User": "Utente sconosciuto",
  "Warning!": "Attenzione!",
  "Okay": "Ok",
  "Failed to sign in with Google. Please try again.": "Accesso con Google fallito. Riprova.",
  "Join Our Community": "Unisciti alla nostra Comunità",
  "Continue with Google": "Continua con Google",
  "An error occurred while sending the image.": "Si è verificato un errore durante l'invio dell'immagine.",
  "Delete Account": "Elimina Account",
  "Are you sure you want to delete your account? This action cannot be undone.": "Sei sicuro di voler eliminare il tuo account? Questa azione non può essere annullata.",
  "Cancel": "Annulla",
  "Delete": "Elimina",
  "Error deleting account. Please try again.": "Errore durante l'eliminazione dell'account. Riprova.",
  "Update Profile": "Aggiorna Profilo",
  "Sign Out": "Esci",
  "Write a message...": "Scrivi un messaggio...",
  "Full Name must contain at least 3 characters and cannot contain numbers.": "Il nome completo deve contenere almeno 3 caratteri e non può contenere numeri.",
  "Age must be a number between 18 and 99.": "L'età deve essere un numero compreso tra 18 e 99.",
  "Short Info must be between 10 and 100 characters.": "Le informazioni brevi devono contenere tra 10 e 100 caratteri.",
  "Please select a profile image.": "Seleziona un'immagine del profilo.",
  "OK": "OK",
  "Full Name": "Nome completo",
  "Age": "Età",
  "Gender": "Genere",
  "Country": "Paese",
  "Short Info": "Informazioni brevi",
  "Delete Message": "Elimina Messaggio",
  "Are you sure you want to delete this message?": "Sei sicuro di voler eliminare questo messaggio?",
  "It will be added very soon. You can try opening this page in other languages.": "Sarà aggiunto molto presto. Puoi provare ad aprire questa pagina in altre lingue.",
  "Sending image...": "Invio immagine...",
  "Image could not be loaded": "Immagine non caricata",
  "Re-authentication failed. Account deletion canceled.": "Autenticazione fallita. Cancellazione dell'account annullata.",
  "An error occurred. Please try again.": "Si è verificato un errore. Per favore riprova.",
  "An update will be coming soon for language support.": "Presto arriverà un aggiornamento per il supporto linguistico.",
  "Your own question": "La tua domanda",
  "Question": "Domanda",
  "Explanation": "Spiegazione",
  "Invalid Question": "Domanda non valida",
  "Question must be between 10 and 100 characters.": "La domanda deve contenere tra 10 e 100 caratteri.",
  "Invalid Explanation": "Spiegazione non valida",
  "Explanation cannot exceed 300 characters.": "La spiegazione non può superare i 300 caratteri.",
  "Success": "Successo",
  "Question added successfully! Your answer will be processed into the system within a few days.": "Domanda aggiunta con successo! La tua risposta sarà elaborata nel sistema entro pochi giorni.",
  "Error": "Errore",
  "Failed to add question. Please try again.": "Impossibile aggiungere la domanda. Per favore riprova.",
  "Add": "Aggiungi",
  "WARNING": "ATTENZIONE",
  "After submitting your question, the answer will be added to the system within a few days.": "Dopo aver inviato la tua domanda, la risposta sarà aggiunta al sistema entro pochi giorni.",
  "+ Add your own question": "+ Aggiungi la tua domanda",
  "Login with Email/Password": "Accedi con email/password",
  "Emails do not match.": "Le email non corrispondono.",
  "Passwords do not match.": "Le password non corrispondono.",
  "This email is already in use.": "Questa email è già in uso.",
  "Invalid email format.": "Formato email non valido.",
  "Password is too weak.": "La password è troppo debole.",
  "Registration failed. Please try again.": "Registrazione fallita. Riprova.",
  "Register": "Registrati",
  "Please enter an email.": "Inserisci un'email.",
  "Please enter a valid email.": "Inserisci un'email valida.",
  "Confirm Email": "Conferma email",
  "Please confirm your email.": "Conferma la tua email.",
  "Password": "Password",
  "Password must be at least 6 characters.": "La password deve essere di almeno 6 caratteri.",
  "Confirm Password": "Conferma password",
  "Please confirm your password.": "Conferma la tua password.",
  "No user found for this email.": "Nessun utente trovato per questa email.",
  "Incorrect password. Please try again.": "Password errata. Riprova.",
  "The email address is not valid.": "L'indirizzo email non è valido.",
  "This user account has been disabled.": "Questo account utente è stato disabilitato.",
  "Too many login attempts. Please try again later.": "Troppi tentativi di accesso. Riprova più tardi.",
  "An unexpected error occurred. Please try again.": "Si è verificato un errore imprevisto. Riprova.",
  "Please enter your email.": "Inserisci la tua email.",
  "Login": "Accedi",
  "Don’t have an account? Register": "Non hai un account? Registrati",
  "Reset Password": "Reimposta la password",
  "Enter your email to receive a password reset link.": "Inserisci la tua email per ricevere un link per reimpostare la password.",
  "Password reset link has been sent to your email.": "Il link per reimpostare la password è stato inviato alla tua email.",
  "Send": "Invia",
  "Forgot your password?": "Hai dimenticato la password?"


}
