{
  "About This App": "Over deze app",
  "This phone app serves as a platform for connecting with others, sharing insights, and addressing questions about topics you may encounter in Belgium. Below, you will find more details about the app’s main features.": "Deze telefoonapp biedt een platform om in contact te komen met anderen, inzichten te delen en vragen te stellen over onderwerpen die u in België kunt tegenkomen. Hieronder vindt u meer informatie over de belangrijkste functies van de app.",
  "Community Section": "Gemeenschapssectie",
  "In the Community section, users can create a public profile through Google login. Once created, this profile is visible to others, allowing you to share photos and posts that the community can view. You can edit your profile anytime, delete posts, and even temporarily log out or delete your account entirely if needed. By tapping on others’ posts, you have the option to start a private conversation with them and explore detailed profile information. Please remember to be cautious with any personal information you share in this public space.": "In de Gemeenschapssectie kunnen gebruikers een openbaar profiel maken via Google-login. Dit profiel is zichtbaar voor anderen, zodat u foto's en berichten kunt delen die de gemeenschap kan bekijken. U kunt uw profiel op elk moment bewerken, berichten verwijderen en indien nodig tijdelijk uitloggen of uw account volledig verwijderen. Door op de berichten van anderen te tikken, kunt u een privégesprek met hen beginnen en gedetailleerde profielinformatie bekijken. Wees voorzichtig met persoonlijke informatie die u in deze openbare ruimte deelt.",
  "Q&A Section": "V&A Sectie",
  "This section offers a space for users to ask and answer questions on a variety of topics related to Belgium. However, please keep in mind that responses are based on users’ personal experiences or internet research and may not always reflect official information. Particularly in legal matters, we recommend consulting an official source or a licensed lawyer. The responses here are intended for general guidance and may become outdated over time.": "Deze sectie biedt een ruimte voor gebruikers om vragen te stellen en te beantwoorden over verschillende onderwerpen met betrekking tot België. Houd er echter rekening mee dat antwoorden zijn gebaseerd op persoonlijke ervaringen van gebruikers of internetspeurwerk en mogelijk niet altijd officiële informatie weerspiegelen. Vooral voor juridische zaken raden we aan een officiële bron of een erkende advocaat te raadplegen. De antwoorden hier zijn bedoeld als algemene richtlijnen en kunnen na verloop van tijd verouderd raken.",
  "Suggestions & Complaints Section": "Suggesties & Klachten Sectie",
  "If you have suggestions or complaints or if there are specific questions you would like us to investigate, feel free to send us an email through this section. We value your feedback and strive to improve the app based on user input.": "Als u suggesties of klachten heeft, of als er specifieke vragen zijn die u wilt dat we onderzoeken, kunt u ons gerust een e-mail sturen via deze sectie. We waarderen uw feedback en streven ernaar de app te verbeteren op basis van gebruikersinput.",
  "Close": "Sluiten",
  "Suggestion & Complaint": "Suggestie & Klacht",
  "About App": "Over App",
  "Community": "Gemeenschap",
  "Question & Answer": "Vraag & Antwoord",
  "Created by Yasir TIRAK": "Gemaakt door Yasir TIRAK",
  "No data found.": "Geen gegevens gevonden.",
  "No menu items found.": "Geen menu-items gevonden.",
  "Explore Belgium": "Verken België",
  "Search questions...": "Zoek vragen...",
  "No questions found.": "Geen vragen gevonden.",
  "Source": "Bron",
  "Contacts": "Contacten",
  "No friends found.": "Geen vrienden gevonden.",
  "Unknown User": "Onbekende gebruiker",
  "Warning!": "Waarschuwing!",
  "Okay": "Oké",
  "Failed to sign in with Google. Please try again.": "Inloggen met Google is mislukt. Probeer het opnieuw.",
  "Join Our Community": "Word lid van onze Gemeenschap",
  "Continue with Google": "Doorgaan met Google",
  "An error occurred while sending the image.": "Er is een fout opgetreden bij het verzenden van de afbeelding.",
  "Delete Account": "Account Verwijderen",
  "Are you sure you want to delete your account? This action cannot be undone.": "Weet u zeker dat u uw account wilt verwijderen? Deze actie kan niet ongedaan worden gemaakt.",
  "Cancel": "Annuleren",
  "Delete": "Verwijderen",
  "Error deleting account. Please try again.": "Fout bij het verwijderen van account. Probeer het opnieuw.",
  "Update Profile": "Profiel Bijwerken",
  "Sign Out": "Uitloggen",
  "Write a message...": "Schrijf een bericht...",
  "Full Name must contain at least 3 characters and cannot contain numbers.": "Volledige naam moet uit minstens 3 tekens bestaan en mag geen cijfers bevatten.",
  "Age must be a number between 18 and 99.": "Leeftijd moet een getal zijn tussen 18 en 99.",
  "Short Info must be between 10 and 100 characters.": "Korte info moet tussen 10 en 100 tekens bevatten.",
  "Please select a profile image.": "Selecteer een profielfoto.",
  "OK": "OK",
  "Full Name": "Volledige Naam",
  "Age": "Leeftijd",
  "Gender": "Geslacht",
  "Country": "Land",
  "Short Info": "Korte Info",
  "Delete Message": "Bericht Verwijderen",
  "Are you sure you want to delete this message?": "Weet u zeker dat u dit bericht wilt verwijderen?",
  "It will be added very soon. You can try opening this page in other languages.": "Het zal zeer binnenkort worden toegevoegd. Je kunt proberen deze pagina in andere talen te openen.",
  "Sending image...": "Beeld wordt verzonden...",
  "Image could not be loaded": "Afbeelding kon niet worden geladen",
  "Re-authentication failed. Account deletion canceled.": "Her-authenticatie mislukt. Accountverwijdering geannuleerd.",
  "An error occurred. Please try again.": "Er is een fout opgetreden. Probeer het opnieuw.",
  "An update will be coming soon for language support.": "Er komt binnenkort een update voor taalondersteuning.",
  "Your own question": "Je eigen vraag",
  "Question": "Vraag",
  "Explanation": "Uitleg",
  "Invalid Question": "Ongeldige vraag",
  "Question must be between 10 and 100 characters.": "De vraag moet tussen de 10 en 100 tekens bevatten.",
  "Invalid Explanation": "Ongeldige uitleg",
  "Explanation cannot exceed 300 characters.": "De uitleg mag niet meer dan 300 tekens bevatten.",
  "Success": "Succes",
  "Question added successfully! Your answer will be processed into the system within a few days.": "Vraag succesvol toegevoegd! Uw antwoord wordt binnen enkele dagen in het systeem verwerkt.",
  "Error": "Fout",
  "Failed to add question. Please try again.": "Het toevoegen van de vraag is mislukt. Probeer het opnieuw.",
  "Add": "Toevoegen",
  "WARNING": "WAARSCHUWING",
  "After submitting your question, the answer will be added to the system within a few days.": "Na het indienen van uw vraag wordt het antwoord binnen enkele dagen aan het systeem toegevoegd.",
  "+ Add your own question": "+ Voeg je eigen vraag toe",
  "Login with Email/Password": "Inloggen met e-mail/wachtwoord",
  "Emails do not match.": "E-mails komen niet overeen.",
  "Passwords do not match.": "Wachtwoorden komen niet overeen.",
  "This email is already in use.": "Dit e-mailadres is al in gebruik.",
  "Invalid email format.": "Ongeldig e-mailadresformaat.",
  "Password is too weak.": "Het wachtwoord is te zwak.",
  "Registration failed. Please try again.": "Registratie mislukt. Probeer het opnieuw.",
  "Register": "Registreren",
  "Please enter an email.": "Voer een e-mailadres in.",
  "Please enter a valid email.": "Voer een geldig e-mailadres in.",
  "Confirm Email": "Bevestig e-mail",
  "Please confirm your email.": "Bevestig uw e-mailadres.",
  "Password": "Wachtwoord",
  "Password must be at least 6 characters.": "Het wachtwoord moet minimaal 6 tekens bevatten.",
  "Confirm Password": "Bevestig wachtwoord",
  "Please confirm your password.": "Bevestig uw wachtwoord.",
  "No user found for this email.": "Geen gebruiker gevonden voor dit e-mailadres.",
  "Incorrect password. Please try again.": "Onjuist wachtwoord. Probeer het opnieuw.",
  "The email address is not valid.": "Het e-mailadres is ongeldig.",
  "This user account has been disabled.": "Dit gebruikersaccount is uitgeschakeld.",
  "Too many login attempts. Please try again later.": "Te veel inlogpogingen. Probeer het later opnieuw.",
  "An unexpected error occurred. Please try again.": "Er is een onverwachte fout opgetreden. Probeer het opnieuw.",
  "Please enter your email.": "Voer uw e-mailadres in.",
  "Login": "Inloggen",
  "Don’t have an account? Register": "Heeft u geen account? Registreren",
  "Reset Password": "Wachtwoord opnieuw instellen",
  "Enter your email to receive a password reset link.": "Voer uw e-mailadres in om een link voor het opnieuw instellen van uw wachtwoord te ontvangen.",
  "Password reset link has been sent to your email.": "De link om uw wachtwoord opnieuw in te stellen is naar uw e-mailadres verzonden.",
  "Send": "Verzenden",
  "Forgot your password?": "Wachtwoord vergeten?"



}
