{
  "About This App": "O tej aplikacji",
  "This phone app serves as a platform for connecting with others, sharing insights, and addressing questions about topics you may encounter in Belgium. Below, you will find more details about the app’s main features.": "Ta aplikacja mobilna służy jako platforma do łączenia się z innymi, dzielenia się spostrzeżeniami i odpowiadania na pytania dotyczące tematów, które mogą pojawić się w Belgii. Poniżej znajdziesz więcej informacji o głównych funkcjach aplikacji.",
  "Community Section": "Sekcja Społeczności",
  "In the Community section, users can create a public profile through Google login. Once created, this profile is visible to others, allowing you to share photos and posts that the community can view. You can edit your profile anytime, delete posts, and even temporarily log out or delete your account entirely if needed. By tapping on others’ posts, you have the option to start a private conversation with them and explore detailed profile information. Please remember to be cautious with any personal information you share in this public space.": "W sekcji Społeczności użytkownicy mogą tworzyć publiczny profil za pomocą logowania przez Google. Po utworzeniu profil jest widoczny dla innych, co pozwala na udostępnianie zdjęć i postów, które mogą być oglądane przez społeczność. Możesz edytować swój profil w dowolnym momencie, usuwać posty, a nawet tymczasowo się wylogować lub całkowicie usunąć swoje konto, jeśli to konieczne. Dotykając postów innych osób, możesz rozpocząć z nimi prywatną rozmowę i przeglądać szczegółowe informacje o profilu. Pamiętaj, aby zachować ostrożność przy udostępnianiu danych osobowych w tej publicznej przestrzeni.",
  "Q&A Section": "Sekcja Pytań i Odpowiedzi",
  "This section offers a space for users to ask and answer questions on a variety of topics related to Belgium. However, please keep in mind that responses are based on users’ personal experiences or internet research and may not always reflect official information. Particularly in legal matters, we recommend consulting an official source or a licensed lawyer. The responses here are intended for general guidance and may become outdated over time.": "Ta sekcja oferuje przestrzeń dla użytkowników do zadawania i odpowiadania na pytania dotyczące różnych tematów związanych z Belgią. Pamiętaj jednak, że odpowiedzi opierają się na doświadczeniach osobistych użytkowników lub na badaniach internetowych i mogą nie zawsze odzwierciedlać oficjalne informacje. Zwłaszcza w kwestiach prawnych zalecamy skonsultowanie się z oficjalnym źródłem lub licencjonowanym prawnikiem. Odpowiedzi tutaj są przeznaczone do ogólnych wskazówek i mogą z czasem stać się nieaktualne.",
  "Suggestions & Complaints Section": "Sekcja Sugestii i Skarg",
  "If you have suggestions or complaints or if there are specific questions you would like us to investigate, feel free to send us an email through this section. We value your feedback and strive to improve the app based on user input.": "Jeśli masz sugestie lub skargi, albo jeśli masz konkretne pytania, które chciałbyś, abyśmy zbadali, nie krępuj się wysłać nam e-maila przez tę sekcję. Cenimy sobie Twoje opinie i dążymy do poprawy aplikacji na podstawie opinii użytkowników.",
  "Close": "Zamknij",
  "Suggestion & Complaint": "Sugestia i Skarga",
  "About App": "O Aplikacji",
  "Community": "Społeczność",
  "Question & Answer": "Pytania i Odpowiedzi",
  "Created by Yasir TIRAK": "Stworzone przez Yasir TIRAK",
  "No data found.": "Brak danych.",
  "No menu items found.": "Nie znaleziono elementów menu.",
  "Explore Belgium": "Poznaj Belgię",
  "Search questions...": "Szukaj pytań...",
  "No questions found.": "Nie znaleziono pytań.",
  "Source": "Źródło",
  "Contacts": "Kontakty",
  "No friends found.": "Nie znaleziono znajomych.",
  "Unknown User": "Nieznany użytkownik",
  "Warning!": "Ostrzeżenie!",
  "Okay": "Ok",
  "Failed to sign in with Google. Please try again.": "Logowanie przez Google nie powiodło się. Spróbuj ponownie.",
  "Join Our Community": "Dołącz do naszej Społeczności",
  "Continue with Google": "Kontynuuj przez Google",
  "An error occurred while sending the image.": "Wystąpił błąd podczas wysyłania obrazu.",
  "Delete Account": "Usuń Konto",
  "Are you sure you want to delete your account? This action cannot be undone.": "Czy na pewno chcesz usunąć swoje konto? Tej operacji nie można cofnąć.",
  "Cancel": "Anuluj",
  "Delete": "Usuń",
  "Error deleting account. Please try again.": "Błąd podczas usuwania konta. Spróbuj ponownie.",
  "Update Profile": "Aktualizuj Profil",
  "Sign Out": "Wyloguj się",
  "Write a message...": "Napisz wiadomość...",
  "Full Name must contain at least 3 characters and cannot contain numbers.": "Pełne imię i nazwisko musi zawierać co najmniej 3 znaki i nie może zawierać cyfr.",
  "Age must be a number between 18 and 99.": "Wiek musi być liczbą od 18 do 99.",
  "Short Info must be between 10 and 100 characters.": "Krótkie informacje muszą mieć od 10 do 100 znaków.",
  "Please select a profile image.": "Wybierz zdjęcie profilowe.",
  "OK": "OK",
  "Full Name": "Pełne imię i nazwisko",
  "Age": "Wiek",
  "Gender": "Płeć",
  "Country": "Kraj",
  "Short Info": "Krótka informacja",
  "Delete Message": "Usuń Wiadomość",
  "Are you sure you want to delete this message?": "Czy na pewno chcesz usunąć tę wiadomość?",
  "It will be added very soon. You can try opening this page in other languages.": "Zostanie to dodane wkrótce. Możesz spróbować otworzyć tę stronę w innych językach.",
  "Sending image...": "Wysyłanie obrazu...",
  "Image could not be loaded": "Nie można załadować obrazu",
  "Re-authentication failed. Account deletion canceled.": "Nie udało się ponownie uwierzytelnić. Anulowano usunięcie konta.",
  "An error occurred. Please try again.": "Wystąpił błąd. Spróbuj ponownie.",
  "An update will be coming soon for language support.": "Wkrótce pojawi się aktualizacja wspierająca języki.",
  "Your own question": "Twoje własne pytanie",
  "Question": "Pytanie",
  "Explanation": "Wyjaśnienie",
  "Invalid Question": "Nieprawidłowe pytanie",
  "Question must be between 10 and 100 characters.": "Pytanie musi zawierać od 10 do 100 znaków.",
  "Invalid Explanation": "Nieprawidłowe wyjaśnienie",
  "Explanation cannot exceed 300 characters.": "Wyjaśnienie nie może przekraczać 300 znaków.",
  "Success": "Sukces",
  "Question added successfully! Your answer will be processed into the system within a few days.": "Pytanie zostało pomyślnie dodane! Twoja odpowiedź zostanie przetworzona w systemie w ciągu kilku dni.",
  "Error": "Błąd",
  "Failed to add question. Please try again.": "Nie udało się dodać pytania. Spróbuj ponownie.",
  "Add": "Dodaj",
  "WARNING": "OSTRZEŻENIE",
  "After submitting your question, the answer will be added to the system within a few days.": "Po przesłaniu pytania odpowiedź zostanie dodana do systemu w ciągu kilku dni.",
  "+ Add your own question": "+ Dodaj własne pytanie",
  "Login with Email/Password": "Zaloguj się za pomocą e-maila/hasła",
  "Emails do not match.": "Adresy e-mail nie pasują do siebie.",
  "Passwords do not match.": "Hasła nie pasują do siebie.",
  "This email is already in use.": "Ten adres e-mail jest już używany.",
  "Invalid email format.": "Nieprawidłowy format e-maila.",
  "Password is too weak.": "Hasło jest zbyt słabe.",
  "Registration failed. Please try again.": "Rejestracja nie powiodła się. Spróbuj ponownie.",
  "Register": "Zarejestruj się",
  "Please enter an email.": "Proszę podać adres e-mail.",
  "Please enter a valid email.": "Proszę podać prawidłowy adres e-mail.",
  "Confirm Email": "Potwierdź e-mail",
  "Please confirm your email.": "Proszę potwierdzić adres e-mail.",
  "Password": "Hasło",
  "Password must be at least 6 characters.": "Hasło musi mieć co najmniej 6 znaków.",
  "Confirm Password": "Potwierdź hasło",
  "Please confirm your password.": "Proszę potwierdzić hasło.",
  "No user found for this email.": "Nie znaleziono użytkownika dla tego adresu e-mail.",
  "Incorrect password. Please try again.": "Nieprawidłowe hasło. Spróbuj ponownie.",
  "The email address is not valid.": "Adres e-mail jest nieprawidłowy.",
  "This user account has been disabled.": "To konto użytkownika zostało wyłączone.",
  "Too many login attempts. Please try again later.": "Zbyt wiele prób logowania. Spróbuj ponownie później.",
  "An unexpected error occurred. Please try again.": "Wystąpił nieoczekiwany błąd. Spróbuj ponownie.",
  "Please enter your email.": "Proszę podać swój adres e-mail.",
  "Login": "Zaloguj się",
  "Don’t have an account? Register": "Nie masz konta? Zarejestruj się",
  "Reset Password": "Zresetuj hasło",
  "Enter your email to receive a password reset link.": "Wprowadź swój e-mail, aby otrzymać link do zresetowania hasła.",
  "Password reset link has been sent to your email.": "Link do zresetowania hasła został wysłany na Twój e-mail.",
  "Send": "Wyślij",
  "Forgot your password?": "Zapomniałeś hasła?"



}
