{
  "About This App": "Sobre este aplicativo",
  "This phone app serves as a platform for connecting with others, sharing insights, and addressing questions about topics you may encounter in Belgium. Below, you will find more details about the app’s main features.": "Este aplicativo serve como uma plataforma para conectar-se com outras pessoas, compartilhar conhecimentos e esclarecer dúvidas sobre temas que você pode encontrar na Bélgica. Abaixo, você encontrará mais detalhes sobre as principais funcionalidades do aplicativo.",
  "Community Section": "Seção Comunidade",
  "In the Community section, users can create a public profile through Google login. Once created, this profile is visible to others, allowing you to share photos and posts that the community can view. You can edit your profile anytime, delete posts, and even temporarily log out or delete your account entirely if needed. By tapping on others’ posts, you have the option to start a private conversation with them and explore detailed profile information. Please remember to be cautious with any personal information you share in this public space.": "Na seção Comunidade, os usuários podem criar um perfil público através do login do Google. Uma vez criado, esse perfil fica visível para os outros, permitindo que você compartilhe fotos e postagens que a comunidade pode ver. Você pode editar seu perfil a qualquer momento, excluir postagens e até mesmo sair temporariamente ou excluir sua conta, se necessário. Ao tocar nas postagens de outros usuários, você tem a opção de iniciar uma conversa privada com eles e explorar informações detalhadas do perfil. Lembre-se de ter cautela ao compartilhar informações pessoais neste espaço público.",
  "Q&A Section": "Seção de Perguntas e Respostas",
  "This section offers a space for users to ask and answer questions on a variety of topics related to Belgium. However, please keep in mind that responses are based on users’ personal experiences or internet research and may not always reflect official information. Particularly in legal matters, we recommend consulting an official source or a licensed lawyer. The responses here are intended for general guidance and may become outdated over time.": "Esta seção oferece um espaço para os usuários fazerem e responderem perguntas sobre diversos temas relacionados à Bélgica. No entanto, lembre-se de que as respostas são baseadas em experiências pessoais dos usuários ou pesquisas na internet e podem não refletir informações oficiais. Em particular, para questões jurídicas, recomendamos consultar uma fonte oficial ou um advogado licenciado. As respostas aqui são destinadas a orientação geral e podem se tornar desatualizadas com o tempo.",
  "Suggestions & Complaints Section": "Seção de Sugestões e Reclamações",
  "If you have suggestions or complaints or if there are specific questions you would like us to investigate, feel free to send us an email through this section. We value your feedback and strive to improve the app based on user input.": "Se você tiver sugestões ou reclamações, ou se houver perguntas específicas que gostaria que investigássemos, fique à vontade para nos enviar um e-mail através desta seção. Valorizamos seu feedback e nos esforçamos para melhorar o aplicativo com base nas opiniões dos usuários.",
  "Close": "Fechar",
  "Suggestion & Complaint": "Sugestão e Reclamação",
  "About App": "Sobre o Aplicativo",
  "Community": "Comunidade",
  "Question & Answer": "Pergunta e Resposta",
  "Created by Yasir TIRAK": "Criado por Yasir TIRAK",
  "No data found.": "Nenhum dado encontrado.",
  "No menu items found.": "Nenhum item de menu encontrado.",
  "Explore Belgium": "Explore a Bélgica",
  "Search questions...": "Pesquisar perguntas...",
  "No questions found.": "Nenhuma pergunta encontrada.",
  "Source": "Fonte",
  "Contacts": "Contatos",
  "No friends found.": "Nenhum amigo encontrado.",
  "Unknown User": "Usuário desconhecido",
  "Warning!": "Aviso!",
  "Okay": "Ok",
  "Failed to sign in with Google. Please try again.": "Falha ao fazer login com o Google. Por favor, tente novamente.",
  "Join Our Community": "Junte-se à nossa Comunidade",
  "Continue with Google": "Continuar com o Google",
  "An error occurred while sending the image.": "Ocorreu um erro ao enviar a imagem.",
  "Delete Account": "Excluir Conta",
  "Are you sure you want to delete your account? This action cannot be undone.": "Tem certeza de que deseja excluir sua conta? Esta ação não pode ser desfeita.",
  "Cancel": "Cancelar",
  "Delete": "Excluir",
  "Error deleting account. Please try again.": "Erro ao excluir conta. Por favor, tente novamente.",
  "Update Profile": "Atualizar Perfil",
  "Sign Out": "Sair",
  "Write a message...": "Escreva uma mensagem...",
  "Full Name must contain at least 3 characters and cannot contain numbers.": "O nome completo deve conter pelo menos 3 caracteres e não pode conter números.",
  "Age must be a number between 18 and 99.": "A idade deve ser um número entre 18 e 99.",
  "Short Info must be between 10 and 100 characters.": "As informações resumidas devem ter entre 10 e 100 caracteres.",
  "Please select a profile image.": "Por favor, selecione uma imagem de perfil.",
  "OK": "OK",
  "Full Name": "Nome Completo",
  "Age": "Idade",
  "Gender": "Gênero",
  "Country": "País",
  "Short Info": "Informação Resumida",
  "Delete Message": "Excluir Mensagem",
  "Are you sure you want to delete this message?": "Tem certeza de que deseja excluir esta mensagem?",
  "It will be added very soon. You can try opening this page in other languages.": "Será adicionado muito em breve. Você pode tentar abrir esta página em outros idiomas.",
  "Sending image...": "Enviando imagem...",
  "Image could not be loaded": "A imagem não pôde ser carregada",
  "Re-authentication failed. Account deletion canceled.": "Reautenticação falhou. Exclusão de conta cancelada.",
  "An error occurred. Please try again.": "Ocorreu um erro. Por favor, tente novamente.",
  "An update will be coming soon for language support.": "Uma atualização estará chegando em breve para suporte de idiomas.",
  "Your own question": "Sua própria pergunta",
  "Question": "Pergunta",
  "Explanation": "Explicação",
  "Invalid Question": "Pergunta inválida",
  "Question must be between 10 and 100 characters.": "A pergunta deve ter entre 10 e 100 caracteres.",
  "Invalid Explanation": "Explicação inválida",
  "Explanation cannot exceed 300 characters.": "A explicação não pode exceder 300 caracteres.",
  "Success": "Sucesso",
  "Question added successfully! Your answer will be processed into the system within a few days.": "Pergunta adicionada com sucesso! Sua resposta será processada no sistema dentro de alguns dias.",
  "Error": "Erro",
  "Failed to add question. Please try again.": "Falha ao adicionar a pergunta. Por favor, tente novamente.",
  "Add": "Adicionar",
  "WARNING": "AVISO",
  "After submitting your question, the answer will be added to the system within a few days.": "Após enviar sua pergunta, a resposta será adicionada ao sistema dentro de alguns dias.",
  "+ Add your own question": "+ Adicione sua própria pergunta",
  "Login with Email/Password": "Entrar com e-mail/senha",
  "Emails do not match.": "Os e-mails não coincidem.",
  "Passwords do not match.": "As senhas não coincidem.",
  "This email is already in use.": "Este e-mail já está em uso.",
  "Invalid email format.": "Formato de e-mail inválido.",
  "Password is too weak.": "A senha é muito fraca.",
  "Registration failed. Please try again.": "Falha no registro. Por favor, tente novamente.",
  "Register": "Registrar",
  "Please enter an email.": "Por favor, insira um e-mail.",
  "Please enter a valid email.": "Por favor, insira um e-mail válido.",
  "Confirm Email": "Confirmar e-mail",
  "Please confirm your email.": "Por favor, confirme seu e-mail.",
  "Password": "Senha",
  "Password must be at least 6 characters.": "A senha deve ter pelo menos 6 caracteres.",
  "Confirm Password": "Confirmar senha",
  "Please confirm your password.": "Por favor, confirme sua senha.",
  "No user found for this email.": "Nenhum usuário encontrado para este e-mail.",
  "Incorrect password. Please try again.": "Senha incorreta. Por favor, tente novamente.",
  "The email address is not valid.": "O endereço de e-mail não é válido.",
  "This user account has been disabled.": "Esta conta de usuário foi desativada.",
  "Too many login attempts. Please try again later.": "Muitas tentativas de login. Por favor, tente novamente mais tarde.",
  "An unexpected error occurred. Please try again.": "Ocorreu um erro inesperado. Por favor, tente novamente.",
  "Please enter your email.": "Por favor, insira seu e-mail.",
  "Login": "Entrar",
  "Don’t have an account? Register": "Não tem uma conta? Registre-se",
  "Reset Password": "Redefinir senha",
  "Enter your email to receive a password reset link.": "Insira seu e-mail para receber um link para redefinir sua senha.",
  "Password reset link has been sent to your email.": "O link para redefinir sua senha foi enviado para o seu e-mail.",
  "Send": "Enviar",
  "Forgot your password?": "Esqueceu sua senha?"



}
