{
  "About This App": "Bu Uygulama Hakkında",
  "This phone app serves as a platform for connecting with others, sharing insights, and addressing questions about topics you may encounter in Belgium. Below, you will find more details about the app’s main features.": "Bu telefon uygulaması, diğerleriyle bağlantı kurmak, bilgi paylaşmak ve Belçika’da karşılaşabileceğiniz konular hakkında sorulara cevap bulmak için bir platform olarak hizmet vermektedir. Aşağıda, uygulamanın ana özellikleri hakkında daha fazla bilgi bulabilirsiniz.",
  "Community Section": "Topluluk Bölümü",
  "In the Community section, users can create a public profile through Google login. Once created, this profile is visible to others, allowing you to share photos and posts that the community can view. You can edit your profile anytime, delete posts, and even temporarily log out or delete your account entirely if needed. By tapping on others’ posts, you have the option to start a private conversation with them and explore detailed profile information. Please remember to be cautious with any personal information you share in this public space.": "Topluluk bölümünde kullanıcılar, Google ile giriş yaparak bir genel profil oluşturabilir. Oluşturulduktan sonra, bu profil başkaları tarafından görülebilir ve topluluğun görüntüleyebileceği fotoğraflar ve gönderiler paylaşmanıza olanak tanır. Profilinizi istediğiniz zaman düzenleyebilir, gönderilerinizi silebilir ve gerektiğinde geçici olarak çıkış yapabilir veya hesabınızı tamamen silebilirsiniz. Diğer kullanıcıların gönderilerine dokunarak onlarla özel bir sohbet başlatabilir ve profil bilgilerini detaylıca inceleyebilirsiniz. Bu kamusal alanda paylaştığınız kişisel bilgilere dikkat etmeyi unutmayın.",
  "Q&A Section": "Soru-Cevap Bölümü",
  "This section offers a space for users to ask and answer questions on a variety of topics related to Belgium. However, please keep in mind that responses are based on users’ personal experiences or internet research and may not always reflect official information. Particularly in legal matters, we recommend consulting an official source or a licensed lawyer. The responses here are intended for general guidance and may become outdated over time.": "Bu bölüm, kullanıcıların Belçika ile ilgili çeşitli konularda soru sormaları ve cevap vermeleri için bir alan sunmaktadır. Ancak, yanıtların kullanıcıların kişisel deneyimlerine veya internet araştırmalarına dayandığını ve her zaman resmi bilgileri yansıtmayabileceğini unutmayın. Özellikle hukuki konularda resmi bir kaynak veya lisanslı bir avukata danışmanızı öneririz. Buradaki yanıtlar genel rehberlik amaçlıdır ve zamanla güncelliğini yitirebilir.",
  "Suggestions & Complaints Section": "Öneri ve Şikayet Bölümü",
  "If you have suggestions or complaints or if there are specific questions you would like us to investigate, feel free to send us an email through this section. We value your feedback and strive to improve the app based on user input.": "Önerileriniz veya şikayetleriniz varsa ya da araştırmamızı istediğiniz belirli sorularınız varsa, bu bölümden bize e-posta göndermekten çekinmeyin. Geri bildirimlerinize değer veriyoruz ve kullanıcı geri bildirimlerine dayanarak uygulamayı geliştirmek için çalışıyoruz.",
  "Close": "Kapat",
  "Suggestion & Complaint": "Öneri ve Şikayet",
  "About App": "Uygulama Hakkında",
  "Community": "Topluluk",
  "Question & Answer": "Soru-Cevap",
  "Created by Yasir TIRAK": "Yasir TIRAK Tarafından Oluşturuldu",
  "No data found.": "Veri bulunamadı.",
  "No menu items found.": "Menü öğesi bulunamadı.",
  "Explore Belgium": "Belçika'yı Keşfet",
  "Search questions...": "Soruları ara...",
  "No questions found.": "Soru bulunamadı.",
  "Source": "Kaynak",
  "Contacts": "Kişiler",
  "No friends found.": "Arkadaş bulunamadı.",
  "Unknown User": "Bilinmeyen Kullanıcı",
  "Warning!": "Uyarı!",
  "Okay": "Tamam",
  "Failed to sign in with Google. Please try again.": "Google ile giriş yapılamadı. Lütfen tekrar deneyin.",
  "Join Our Community": "Topluluğumuza Katıl",
  "Continue with Google": "Google ile Devam Et",
  "An error occurred while sending the image.": "Görsel gönderilirken bir hata oluştu.",
  "Delete Account": "Hesabı Sil",
  "Are you sure you want to delete your account? This action cannot be undone.": "Hesabınızı silmek istediğinizden emin misiniz? Bu işlem geri alınamaz.",
  "Cancel": "İptal",
  "Delete": "Sil",
  "Error deleting account. Please try again.": "Hesap silinirken bir hata oluştu. Lütfen tekrar deneyin.",
  "Update Profile": "Profili Güncelle",
  "Sign Out": "Çıkış Yap",
  "Write a message...": "Bir mesaj yaz...",
  "Full Name must contain at least 3 characters and cannot contain numbers.": "Ad Soyad en az 3 karakter içermeli ve rakam içermemelidir.",
  "Age must be a number between 18 and 99.": "Yaş 18 ile 99 arasında bir sayı olmalıdır.",
  "Short Info must be between 10 and 100 characters.": "Kısa Bilgi 10 ile 100 karakter arasında olmalıdır.",
  "Please select a profile image.": "Lütfen bir profil resmi seçin.",
  "OK": "Tamam",
  "Full Name": "Ad Soyad",
  "Age": "Yaş",
  "Gender": "Cinsiyet",
  "Country": "Ülke",
  "Short Info": "Kısa Bilgi",
  "Delete Message": "Mesajı Sil",
  "Are you sure you want to delete this message?": "Bu mesajı silmek istediğinizden emin misiniz?",
  "It will be added very soon. You can try opening this page in other languages.": "Çok yakında eklenecek. Bu sayfayı başka dillerde açmayı deneyebilirsiniz.",
  "Sending image...": "Resim gönderiliyor...",
  "Image could not be loaded": "Resim yüklenemedi",
  "Re-authentication failed. Account deletion canceled.": "Yeniden kimlik doğrulama başarısız. Hesap silme iptal edildi.",
  "An error occurred. Please try again.": "Bir hata oluştu. Lütfen tekrar deneyin.",
  "An update will be coming soon for language support.": "Dil desteği için yakında bir güncelleme gelecek.",
  "Your own question": "Kendi sorunuz",
  "Question": "Soru",
  "Explanation": "Açıklama",
  "Invalid Question": "Geçersiz soru",
  "Question must be between 10 and 100 characters.": "Soru 10 ile 100 karakter arasında olmalıdır.",
  "Invalid Explanation": "Geçersiz açıklama",
  "Explanation cannot exceed 300 characters.": "Açıklama 300 karakteri geçemez.",
  "Success": "Başarılı",
  "Question added successfully! Your answer will be processed into the system within a few days.": "Soru başarıyla eklendi! Cevabınız birkaç gün içinde sisteme işlenecek.",
  "Error": "Hata",
  "Failed to add question. Please try again.": "Soru eklenemedi. Lütfen tekrar deneyin.",
  "Add": "Ekle",
  "WARNING": "UYARI",
  "After submitting your question, the answer will be added to the system within a few days.": "Sorunuzu gönderdikten sonra cevabınız birkaç gün içinde sisteme eklenecektir.",
  "+ Add your own question": "+ Kendi sorunuzu ekleyin",
  "Login with Email/Password": "E-posta/Şifre ile giriş yap",
  "Emails do not match.": "E-postalar eşleşmiyor.",
  "Passwords do not match.": "Şifreler eşleşmiyor.",
  "This email is already in use.": "Bu e-posta zaten kullanımda.",
  "Invalid email format.": "Geçersiz e-posta formatı.",
  "Password is too weak.": "Şifre çok zayıf.",
  "Registration failed. Please try again.": "Kayıt başarısız oldu. Lütfen tekrar deneyin.",
  "Register": "Kayıt Ol",
  "Please enter an email.": "Lütfen bir e-posta girin.",
  "Please enter a valid email.": "Lütfen geçerli bir e-posta girin.",
  "Confirm Email": "E-postayı Onayla",
  "Please confirm your email.": "Lütfen e-postanızı onaylayın.",
  "Password": "Şifre",
  "Password must be at least 6 characters.": "Şifre en az 6 karakter olmalıdır.",
  "Confirm Password": "Şifreyi Onayla",
  "Please confirm your password.": "Lütfen şifrenizi onaylayın.",
  "No user found for this email.": "Bu e-posta için kullanıcı bulunamadı.",
  "Incorrect password. Please try again.": "Hatalı şifre. Lütfen tekrar deneyin.",
  "The email address is not valid.": "E-posta adresi geçerli değil.",
  "This user account has been disabled.": "Bu kullanıcı hesabı devre dışı bırakılmış.",
  "Too many login attempts. Please try again later.": "Çok fazla giriş denemesi yapıldı. Lütfen daha sonra tekrar deneyin.",
  "An unexpected error occurred. Please try again.": "Beklenmeyen bir hata oluştu. Lütfen tekrar deneyin.",
  "Please enter your email.": "Lütfen e-postanızı girin.",
  "Login": "Giriş Yap",
  "Don’t have an account? Register": "Hesabınız yok mu? Kayıt Ol",
  "Reset Password": "Şifreyi Sıfırla",
  "Enter your email to receive a password reset link.": "Şifre sıfırlama bağlantısı almak için e-posta adresinizi girin.",
  "Password reset link has been sent to your email.": "Şifre sıfırlama bağlantısı e-posta adresinize gönderildi.",
  "Send": "Gönder",
  "Forgot your password?": "Şifrenizi mi unuttunuz?"


}
